const 开发指南 = [
  {
    title: '多端快速入门',
    collapsable: false,
    children: [
      {
        title: '小程序端快速入门',
        collapsable: false,
        children: [
          ['多端快速入门/小程序端快速入门/入门概述','入门概述'],
          ['多端快速入门/小程序端快速入门/控制台简介','控制台简介'],
          ['多端快速入门/小程序端快速入门/注册小程序帐号','注册小程序帐号'],
          ['多端快速入门/小程序端快速入门/开通云开发服务','开通云开发服务'],
          ['多端快速入门/小程序端快速入门/开发小程序','开发小程序']
        ]
      },
      {
        title: 'Web端快速入门',
        collapsable: false,
        children: [
          ['多端快速入门/Web端快速入门/入门概述','入门概述'],
          ['多端快速入门/Web端快速入门/控制台简介','控制台简介'],
          ['多端快速入门/Web端快速入门/注册网站应用','注册网站应用'],
          ['多端快速入门/Web端快速入门/开通云开发服务','开通云开发服务'],
          ['多端快速入门/Web端快速入门/开发网站应用','开发网站应用']
        ]
      },
    ]
  },
  {
    title: '能力详解',
    collapsable: false,
    children: [
      {
        title: '数据库',
        collapsable: false,
        children: [
          {
            title: '小程序端',
            collapsable: false,
            children: [
              ['能力详解/数据库/小程序端/概述','概述'],
              ['能力详解/数据库/小程序端/数据类型','数据类型'],
              ['能力详解/数据库/小程序端/管理数据库','管理数据库'],
              ['能力详解/数据库/小程序端/初始化','初始化'],
              ['能力详解/数据库/小程序端/导入数据','导入数据'],
              ['能力详解/数据库/小程序端/导出数据','导出数据'],
              ['能力详解/数据库/小程序端/插入数据','插入数据'],
              ['能力详解/数据库/小程序端/读取数据','读取数据'],
              ['能力详解/数据库/小程序端/构建查询条件','构建查询条件'],
              ['能力详解/数据库/小程序端/更新数据','更新数据'],
              ['能力详解/数据库/小程序端/删除数据','删除数据'],
              ['能力详解/数据库/小程序端/索引管理','索引管理'],
            ]
          },
          {
            title: 'Web端',
            collapsable: false,
            children: [
              ['能力详解/数据库/Web端/概述','概述'],
              ['能力详解/数据库/Web端/数据类型','数据类型'],
              ['能力详解/数据库/Web端/管理数据库','管理数据库'],
              ['能力详解/数据库/Web端/初始化','初始化'],
              ['能力详解/数据库/Web端/导入数据','导入数据'],
              ['能力详解/数据库/Web端/导出数据','导出数据'],
              ['能力详解/数据库/Web端/插入数据','插入数据'],
              ['能力详解/数据库/Web端/读取数据','读取数据'],
              ['能力详解/数据库/Web端/构建查询条件','构建查询条件'],
              ['能力详解/数据库/Web端/更新数据','更新数据'],
              ['能力详解/数据库/Web端/删除数据','删除数据'],
              ['能力详解/数据库/Web端/索引管理','索引管理'],
            ]
          }
        ]
      },
      {
        title: '云存储',
        collapsable: false,
        children: [
          {
            title: '小程序端',
            collapsable: false,
            children: [
              ['能力详解/云存储/小程序端/概述','概述'],
              ['能力详解/云存储/小程序端/管理文件','管理文件'],
              ['能力详解/云存储/小程序端/上传文件','上传文件'],
              ['能力详解/云存储/小程序端/下载文件','下载文件'],
              ['能力详解/云存储/小程序端/删除文件','删除文件'],
              ['能力详解/云存储/小程序端/换取临时链接','换取临时链接'],
              ['能力详解/云存储/小程序端/小程序组件支持','小程序组件支持'],
            ]
          },
          {
            title: 'Web端',
            collapsable: false,
            children: [
              ['能力详解/云存储/Web端/概述','概述'],
              ['能力详解/云存储/Web端/管理文件','管理文件'],
              ['能力详解/云存储/Web端/上传文件','上传文件'],
              ['能力详解/云存储/Web端/下载文件','下载文件'],
              ['能力详解/云存储/Web端/删除文件','删除文件'],
              ['能力详解/云存储/Web端/换取临时链接','换取临时链接'],
            ]
          }
        ]
      },
      {
        title: '云函数',
        collapsable: false,
        children: [
          {
            title: '小程序端',
            collapsable: false,
            children: [
              ['能力详解/云函数/小程序端/概述','概述'],
              ['能力详解/云函数/小程序端/运行机制','运行机制'],
              ['能力详解/云函数/小程序端/使用npm','使用npm'],
              ['能力详解/云函数/小程序端/创建云函数','创建云函数'],
              ['能力详解/云函数/小程序端/管理云函数','管理云函数'],
              ['能力详解/云函数/小程序端/调用云函数','调用云函数'],
              ['能力详解/云函数/小程序端/测试、日志与监控','测试、日志与监控'],
              ['能力详解/云函数/小程序端/获取用户信息','获取用户信息'],
              ['能力详解/云函数/小程序端/定时触发器','定时触发器'],
              ['能力详解/云函数/小程序端/异步返回结果','异步返回结果'],
              ['能力详解/云函数/小程序端/注意事项','注意事项']
            ]
          },
          {
            title: 'Web端',
            collapsable: false,
            children: [
              ['能力详解/云函数/Web端/概述','概述'],
              ['能力详解/云函数/Web端/运行机制','运行机制'],
              ['能力详解/云函数/Web端/创建云函数','创建云函数'],
              ['能力详解/云函数/Web端/管理云函数','管理云函数'],
              ['能力详解/云函数/Web端/调用云函数','调用云函数'],
              ['能力详解/云函数/Web端/测试、日志与监控','测试、日志与监控'],
              ['能力详解/云函数/Web端/获取用户信息','获取用户信息'],
              ['能力详解/云函数/Web端/定时触发器','定时触发器'],
              ['能力详解/云函数/Web端/异步返回结果','异步返回结果'],
              ['能力详解/云函数/Web端/注意事项','注意事项']
            ]
          }
        ]
      },
      {
        title: '云调用',
        collapsable: false,
        children: [
          {
            title: '小程序端',
            collapsable: false,
            children: [
              ['能力详解/云调用/小程序端/能力概览','能力概览'],
              ['能力详解/云调用/小程序端/接口列表','接口列表']
            ]
          }
        ]
      },
      
    ]
  },
]

const 产品介绍 = [
  ['产品概述', '产品概述'],
  {
    title: '基本概念',
    collapsable: false,
    children: [
      ['基本概念/Web 端基本概念', 'Web 端基本概念'],
      ['基本概念/小程序端基本概念', '小程序端基本概念']
    ]
  },
  ['应用场景', '应用场景'],
  ['相关产品', '相关产品'],
]

const 技术分享 = [
  {
    title: '官方教程',
    collapsable: false,
    children: [
      ['官方教程/树洞小程序', '树洞小程序'],
      ['官方教程/论坛小程序', '论坛小程序'],
      ['官方教程/相册小程序', '相册小程序'],
      ['官方教程/AI名片小程序', 'AI名片小程序'],
      ['官方教程/智能美颜相册小程序', '智能美颜相册小程序']
    ]
  },
  {
    title: '实战分享',
    collapsable: false,
    children: [
      ['实战分享/Taro商城实战', 'Taro商城实战'],
      ['实战分享/婚礼小程序', '婚礼小程序'],
      ['实战分享/更多教程文章', '更多教程文章']
    ]
  },
  {
    title: '客户案例',
    collapsable: false,
    children: [
      ['客户案例/猫眼', '猫眼'],
      ['客户案例/转转', '转转'],
      ['客户案例/乐享花园', '乐享花园']
    ]
  },
  {
    title: '洞察',
    collapsable: false,
    children: [
      ['洞察/从前端到全栈', '从前端到全栈']
    ]
  },
  {
    title: '视频教学',
    collapsable: false,
    children: [
      {
        title: '基础教程',
        collapsable: false,
        children: [
          ['视频教学/基础教程/1.小程序-云开发-概念基础', '1.概念基础'],
          ['视频教学/基础教程/2.小程序-云开发-操作基础', '2.操作基础'],
          ['视频教学/基础教程/3.小程序-云开发-云开发API基础', '3.云开发API基础'],
        ]
      },
      {
        title: '中级课程',
        collapsable: false,
        children: [
          ['视频教学/中级课程/1.小程序-云开发-云函数项目实战', '1.云函数项目实战'],
          ['视频教学/中级课程/2.小程序-云开发-数据库项目实战', '2.数据库项目实战'],
          ['视频教学/中级课程/3.小程序-云开发-文件存储项目实战', '3.文件存储项目实战'],
        ]
      },
      {
        title: '高阶实战',
        collapsable: false,
        children: [
          ['视频教学/高阶实战/1.巧借 [ 小程序云开发 ] 快速接入微信支付功能', '1.巧借 [ 小程序云开发 ] 快速接入微信支付功能'],
          ['视频教学/高阶实战/2.小程序-云开发-私房书柜项目实战', '2.私房书柜项目实战'],
          ['视频教学/高阶实战/3.从0到1实现音乐播放器小程序', '3.从0到1实现音乐播放器小程序'],
        ]
      },
      {
        title: '小程序-云开发基础',
        collapsable: false,
        children: [
          ['视频教学/小程序-云开发基础/1.了解云开发基础', '1.了解云开发基础'],
          ['视频教学/小程序-云开发基础/2.云开发数据库能力介绍', '2.云开发数据库能力介绍'],
          ['视频教学/小程序-云开发基础/3.云开发数据库权限介绍', '3.云开发数据库权限介绍.'],
          ['视频教学/小程序-云开发基础/4.云开发文件存储能力介绍', '4.云开发文件存储能力介绍'],
          ['视频教学/小程序-云开发基础/5.云函数基础用法之定时器', '5.云函数基础用法之定时器'],
          ['视频教学/小程序-云开发基础/6.云开发实战之 TODO', '6.云开发实战之 TODO'],
          ['视频教学/小程序-云开发基础/7.云函数应用之数据库操作', '7.云函数应用之数据库操作'],
          ['视频教学/小程序-云开发基础/8.云函数应用之功能操作', '8.云函数应用之功能操作'],
        ]
      },
      {
        title: '小游戏-云开发实战',
        collapsable: false,
        children: [
          ['视频教学/小游戏-云开发实战/1.云开发介绍', '1.云开发介绍'],
          ['视频教学/小游戏-云开发实战/2.游戏云开发基础', '2.游戏云开发基础'],
          ['视频教学/小游戏-云开发实战/3.用户登录注册', '3.用户登录注册'],
          ['视频教学/小游戏-云开发实战/4.小游戏分享', '4.小游戏分享'],
          ['视频教学/小游戏-云开发实战/5.小游戏实现', '5.小游戏实现'],
          ['视频教学/小游戏-云开发实战/6.广告接入', '6.广告接入'],
          ['视频教学/小游戏-云开发实战/7.云开发支付', '7.云开发支付'],
        ]
      },
      {
        title: '电商小程序-云开发初探',
        collapsable: false,
        children: [
          ['视频教学/电商小程序-云开发初探/1.课程介绍', '1.课程介绍'],
          ['视频教学/电商小程序-云开发初探/2.个人中心', '2.个人中心'],
          ['视频教学/电商小程序-云开发初探/3.电商小程序雏形', '3.电商小程序雏形'],
          ['视频教学/电商小程序-云开发初探/4.电商通用功能-上', '4.电商通用功能-上'],
          ['视频教学/电商小程序-云开发初探/5.电商通用功能-下', '5.电商通用功能-下'],
          ['视频教学/电商小程序-云开发初探/6.电商业务营销功能', '6.电商业务营销功能'],
        ]
      }
    ]
  }
]

const SDK文档 = [
  {
    title: 'PHP',
    collapsable: false,
    children: [
      ['PHP SDK/0.介绍', '0.介绍'],
      ['PHP SDK/1.初始化', '1.初始化'],
      ['PHP SDK/2.存储', '2.存储'],
      ['PHP SDK/3.数据库', '3.数据库'],
      ['PHP SDK/4.云函数', '4.云函数'],
      ['PHP SDK/5.如何结合sdk编写云函数', '5.如何结合sdk编写云函数'],
    ]
  }
]

const 增值能力 = [
  ['云开发扩展能力简介', '云开发扩展能力简介'],
  ['云开发扩展能力计费方式', '云开发扩展能力计费方式'],
  ['一键部署介绍', '一键部署介绍'],
  {
    title: 'AI智能图像',
    collapsable: false,
    children: [
      ['AI人脸特征分析与检测/AI人脸特征检测与分析介绍', 'AI人脸特征检测与分析介绍'],
      ['AI人脸特征分析与检测/AI人脸特征检测与分析使用场景', 'AI人脸特征检测与分析使用场景'],
      ['AI人脸特征分析与检测/AI人脸特征分析与检测使用指引', 'AI人脸特征分析与检测使用指引'],
      {
        title: '使用案例',
        collapsable: false,
        children: [
          ['AI人脸特征分析与检测/使用案例/智能裁剪', '智能剪裁'],
          ['AI人脸特征分析与检测/使用案例/人脸隐私保护', '人脸隐私保护'],
          ['AI人脸特征分析与检测/使用案例/2 分钟完成颜值打分小程序', '2 分钟完成颜值打分小程序'],
        ]
      }
    ]
  }
]

module.exports = {
  '/开发指南/': 开发指南,
  '/产品介绍/': 产品介绍,
  '/技术分享/': 技术分享,
  '/SDK 文档/': SDK文档,
  '/增值能力/': 增值能力,
}
