// 开发指南
const kaifazhinan = [
  {
    title: '云函数',
    children: [
      ['云函数/概述', '概述'],
      ['云函数/注意事项', '注意事项'],
      ['云函数/运行机制', '运行机制'],
      ['云函数/调用云函数', '调用云函数']
    ]
  },
  {
    title: '存储管理',
    children: [
      '存储管理/上传文件',
      '存储管理/下载文件',
      '存储管理/删除文件',
      '存储管理/管理文件',
    ]
  },
  {
    title: '数据库',
    children: [
      '数据库/初始化',
      '数据库/删除数据',
      '数据库/导入数据',
      '数据库/插入数据',
    ]
  }
]

// 产品介绍
const chanpinjieshao = [
  ['产品概述', '产品概述'],
  ['应用场景', '应用场景'],
  ['相关产品', '相关产品'],
  {
    title: '基本概念',
    children: [
      ['基本概念/Web 端基本概念', 'Web 端基本概念'],
      ['基本概念/小程序端基本概念', '小程序端基本概念']
    ]
  }
]

module.exports = {
  '/开发指南/': kaifazhinan,
  '/产品介绍/': chanpinjieshao
}
