const 开发指南 = [
  {
    title: '多端快速入门',
    collapsable: false,
    children: [
      {
        title: '小程序端快速入门',
        collapsable: true,
        children: [
          ['多端快速入门/小程序端快速入门/入门概述','入门概述'],
          ['多端快速入门/小程序端快速入门/控制台简介','控制台简介'],
          ['多端快速入门/小程序端快速入门/注册小程序帐号','注册小程序帐号'],
          ['多端快速入门/小程序端快速入门/开通云开发服务','开通云开发服务'],
          ['多端快速入门/小程序端快速入门/开发小程序','开发小程序']
        ]
      },
      {
        title: 'Web端快速入门',
        collapsable: true,
        children: [
          ['多端快速入门/Web端快速入门/入门概述','入门概述'],
          ['多端快速入门/Web端快速入门/控制台简介','控制台简介'],
          ['多端快速入门/Web端快速入门/注册网站应用','注册网站应用'],
          ['多端快速入门/Web端快速入门/开通云开发服务','开通云开发服务'],
          ['多端快速入门/Web端快速入门/开发网站应用','开发网站应用']
        ]
      },
    ]
  },
  {
    title: '能力详解',
    collapsable: false,
    children: [
      {
        title: '数据库',
        collapsable: true,
        children: [
          {
            title: '小程序端',
            collapsable: true,
            children: [
              ['能力详解/数据库/小程序端/概述','概述'],
              ['能力详解/数据库/小程序端/数据类型','数据类型'],
              ['能力详解/数据库/小程序端/管理数据库','管理数据库'],
              ['能力详解/数据库/小程序端/初始化','初始化'],
              ['能力详解/数据库/小程序端/导入数据','导入数据'],
              ['能力详解/数据库/小程序端/导出数据','导出数据'],
              ['能力详解/数据库/小程序端/插入数据','插入数据'],
              ['能力详解/数据库/小程序端/读取数据','读取数据'],
              ['能力详解/数据库/小程序端/构建查询条件','构建查询条件'],
              ['能力详解/数据库/小程序端/更新数据','更新数据'],
              ['能力详解/数据库/小程序端/删除数据','删除数据'],
              ['能力详解/数据库/小程序端/索引管理','索引管理'],
            ]
          },
          {
            title: 'Web端',
            collapsable: true,
            children: [
              ['能力详解/数据库/Web端/概述','概述'],
              ['能力详解/数据库/Web端/数据类型','数据类型'],
              ['能力详解/数据库/Web端/管理数据库','管理数据库'],
              ['能力详解/数据库/Web端/初始化','初始化'],
              ['能力详解/数据库/Web端/导入数据','导入数据'],
              ['能力详解/数据库/Web端/导出数据','导出数据'],
              ['能力详解/数据库/Web端/插入数据','插入数据'],
              ['能力详解/数据库/Web端/读取数据','读取数据'],
              ['能力详解/数据库/Web端/构建查询条件','构建查询条件'],
              ['能力详解/数据库/Web端/更新数据','更新数据'],
              ['能力详解/数据库/Web端/删除数据','删除数据'],
              ['能力详解/数据库/Web端/索引管理','索引管理'],
            ]
          }
        ]
      },
      {
        title: '云存储',
        collapsable: true,
        children: [
          {
            title: '小程序端',
            collapsable: true,
            children: [
              ['能力详解/云存储/小程序端/概述','概述'],
              ['能力详解/云存储/小程序端/管理文件','管理文件'],
              ['能力详解/云存储/小程序端/上传文件','上传文件'],
              ['能力详解/云存储/小程序端/下载文件','下载文件'],
              ['能力详解/云存储/小程序端/删除文件','删除文件'],
              ['能力详解/云存储/小程序端/换取临时链接','换取临时链接'],
              ['能力详解/云存储/小程序端/小程序组件支持','小程序组件支持'],
            ]
          },
          {
            title: 'Web端',
            collapsable: true,
            children: [
              ['能力详解/云存储/Web端/概述','概述'],
              ['能力详解/云存储/Web端/管理文件','管理文件'],
              ['能力详解/云存储/Web端/上传文件','上传文件'],
              ['能力详解/云存储/Web端/下载文件','下载文件'],
              ['能力详解/云存储/Web端/删除文件','删除文件'],
              ['能力详解/云存储/Web端/换取临时链接','换取临时链接'],
            ]
          }
        ]
      },
      {
        title: '云函数',
        collapsable: true,
        children: [
          {
            title: '小程序端',
            collapsable: true,
            children: [
              ['能力详解/云函数/小程序端/概述','概述'],
              ['能力详解/云函数/小程序端/运行机制','运行机制'],
              ['能力详解/云函数/小程序端/使用npm','使用npm'],
              ['能力详解/云函数/小程序端/创建云函数','创建云函数'],
              ['能力详解/云函数/小程序端/管理云函数','管理云函数'],
              ['能力详解/云函数/小程序端/调用云函数','调用云函数'],
              ['能力详解/云函数/小程序端/测试、日志与监控','测试、日志与监控'],
              ['能力详解/云函数/小程序端/获取用户信息','获取用户信息'],
              ['能力详解/云函数/小程序端/定时触发器','定时触发器'],
              ['能力详解/云函数/小程序端/异步返回结果','异步返回结果'],
              ['能力详解/云函数/小程序端/注意事项','注意事项']
            ]
          },
          {
            title: 'Web端',
            collapsable: true,
            children: [
              ['能力详解/云函数/Web端/概述','概述'],
              ['能力详解/云函数/Web端/运行机制','运行机制'],
              ['能力详解/云函数/Web端/创建云函数','创建云函数'],
              ['能力详解/云函数/Web端/管理云函数','管理云函数'],
              ['能力详解/云函数/Web端/调用云函数','调用云函数'],
              ['能力详解/云函数/Web端/测试、日志与监控','测试、日志与监控'],
              ['能力详解/云函数/Web端/获取用户信息','获取用户信息'],
              ['能力详解/云函数/Web端/定时触发器','定时触发器'],
              ['能力详解/云函数/Web端/异步返回结果','异步返回结果'],
              ['能力详解/云函数/Web端/注意事项','注意事项']
            ]
          }
        ]
      },
      {
        title: '云调用',
        collapsable: true,
        children: [
          {
            title: '小程序端',
            collapsable: true,
            children: [

            ]
          }
        ]
      },
      
    ]
  },
  // {
  //   title: '数据库',
  //   collapsable: false,
  //   children: [
  //     ['数据库/概述', '概述'],
  //     ['数据库/数据类型', '数据类型'],
  //     ['数据库/管理数据库', '管理数据库'],
  //     ['数据库/初始化', '初始化'],
  //     ['数据库/导入数据', '导入数据'],
  //     ['数据库/导出数据', '导出数据'],
  //     ['数据库/插入数据', '插入数据'],
  //     ['数据库/读取数据', '读取数据'],
  //     ['数据库/构建查询条件', '构建查询数据'],
  //     ['数据库/更新数据', '更新数据'],
  //     ['数据库/删除数据', '删除数据'],
  //     ['数据库/索引管理', '索引管理'],
  //   ]
  // },
  // {
  //   title: '云存储',
  //   collapsable: false,
  //   children: [
  //     ['存储管理/概述', '概述'],
  //     ['存储管理/管理文件', '管理文件'],
  //     ['存储管理/上传文件', '上传文件'],
  //     ['存储管理/下载文件', '下载文件'],
  //     ['存储管理/删除文件', '删除文件'],
  //     ['存储管理/换取临时链接', '换取临时链接'],
  //     ['存储管理/小程序组件支持', '组件和支持'],
  //   ]
  // },
  // {
  //   title: '云函数',
  //   collapsable: false,
  //   children: [
  //     ['云函数/概述', '概述'],
  //     ['云函数/运行机制', '运行机制'],
  //     ['云函数/使用 npm', '使用 npm'],
  //     ['云函数/创建云函数', '创建云函数'],
  //     ['云函数/管理云函数', '管理云函数'],
  //     ['云函数/调用云函数', '调用云函数'],
  //     ['云函数/测试、日志与监控', '测试、日志与监控'],
  //     ['云函数/获取用户信息', '获取用户信息'],
  //     ['云函数/定时触发器', '定时触发器'],
  //     ['云函数/异步返回结果', '异步返回结果'],
  //     ['云函数/注意事项', '注意事项 & FAQ'],
  //   ]
  // },
]

const 产品介绍 = [
  ['产品概述', '产品概述'],
  {
    title: '基本概念',
    collapsable: false,
    children: [
      ['基本概念/Web 端基本概念', 'Web 端基本概念'],
      ['基本概念/小程序端基本概念', '小程序端基本概念']
    ]
  },
  ['应用场景', '应用场景'],
  ['相关产品', '相关产品'],
]

const 技术分享 = [
  {
    title: '官方教程',
    collapsable: false,
    children: [
      ['官方教程/树洞小程序', '树洞小程序'],
      ['官方教程/论坛小程序', '论坛小程序'],
      ['官方教程/相册小程序', '相册小程序'],
      ['官方教程/AI名片小程序', 'AI名片小程序']
    ]
  },
  {
    title: '实战分享',
    collapsable: false,
    children: [
      ['实战分享/Taro商城实战', 'Taro商城实战'],
      ['实战分享/婚礼小程序', '婚礼小程序'],
      ['实战分享/更多教程文章', '更多教程文章']
    ]
  },
  {
    title: '客户案例',
    collapsable: false,
    children: [
      ['客户案例/猫眼', '猫眼'],
      ['客户案例/转转', '转转'],
      ['客户案例/乐享花园', '乐享花园']
    ]
  },
  {
    title: '洞察',
    collapsable: false,
    children: [
      ['洞察/从前端到全栈', '从前端到全栈'],
      ['洞察/云调用', '云调用']
    ]
  },
  {
    title: '视频教学',
    collapsable: false,
    children: [
      ['视频教学/小程序-云开发-操作实践', '操作实践'],
      ['视频教学/小程序-云开发-概念基础', '概念基础'],
      ['视频教学/小程序-云开发-云函数项目实战', '云函数项目实战'],
      ['视频教学/小程序-云开发-云开发API基础', '云开发API基础']
    ]
  }
]

module.exports = {
  '/开发指南/': 开发指南,
  '/产品介绍/': 产品介绍,
  '/技术分享/': 技术分享,
}
